{
  "path": "java.sql",
  "name": "Types",
  "values": [
    {
      "type": "constant"
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "ARRAY",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type ARRAY."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "BIGINT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type BIGINT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "BINARY",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type BINARY."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "BIT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type BIT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "BLOB",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type BLOB."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "BOOLEAN",
      "desc": "The constant in the Java programming language, somtimes referred to as a type code, that identifies the generic SQL type BOOLEAN."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "CHAR",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type CHAR."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "CLOB",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type CLOB."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "DATALINK",
      "desc": "The constant in the Java programming language, somtimes referred to as a type code, that identifies the generic SQL type DATALINK."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "DATE",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type DATE."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "DECIMAL",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type DECIMAL."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "DISTINCT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type DISTINCT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "DOUBLE",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type DOUBLE."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "FLOAT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type FLOAT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "INTEGER",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type INTEGER."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "JAVA_OBJECT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type JAVA_OBJECT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "LONGNVARCHAR",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type LONGNVARCHAR."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "LONGVARBINARY",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type LONGVARBINARY."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "LONGVARCHAR",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type LONGVARCHAR."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "NCHAR",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type NCHAR"
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "NCLOB",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type NCLOB."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "NULL",
      "desc": "The constant in the Java programming language that identifies the generic SQL value NULL."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "NUMERIC",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type NUMERIC."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "NVARCHAR",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type NVARCHAR."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "OTHER",
      "desc": "The constant in the Java programming language that indicates that the SQL type is database-specific and gets mapped to a Java object that can be accessed via the methods getObject and setObject."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "REAL",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type REAL."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "REF",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type REF."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "ROWID",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type ROWID"
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "SMALLINT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type SMALLINT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "SQLXML",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type XML."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "STRUCT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type STRUCT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "TIME",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type TIME."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "TIMESTAMP",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type TIMESTAMP."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "TINYINT",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type TINYINT."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "VARBINARY",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type VARBINARY."
    },
    {
      "type": "constant",
      "keyword": "static",
      "identifier": "Int",
      "code": "VARCHAR",
      "desc": "The constant in the Java programming language, sometimes referred to as a type code, that identifies the generic SQL type VARCHAR."
    }
  ]
}