[
  [
    {
      "Error code": "AuthFailure",
      "Description": "The provided credentials could not be validated. You may not be authorized to carry out the request; for example, associating an Elastic IP address that is not yours, or trying to use an AMI for which you do not have permissions. Ensure that your account is authorized to use the Amazon EC2 service, that your credit card details are correct, and that you are using the correct access keys."
    },
    {
      "Error code": "Blocked",
      "Description": "Your account is currently blocked. Contact aws-verification@amazon.com if you have questions."
    },
    {
      "Error code": "DryRunOperation",
      "Description": "The user has the required permissions, so the request would have succeeded, but the DryRun parameter was used."
    },
    {
      "Error code": "IdempotentParameterMismatch",
      "Description": "The request uses the same client token as a previous, but non-identical request. Do not reuse a client token with different requests, unless the requests are identical."
    },
    {
      "Error code": "IncompleteSignature",
      "Description": "The request signature does not conform to AWS standards."
    },
    {
      "Error code": "InvalidAction",
      "Description": "The action or operation requested is not valid. Verify that the action is typed correctly."
    },
    {
      "Error code": "InvalidCharacter",
      "Description": "A specified character is invalid."
    },
    {
      "Error code": "InvalidClientTokenId",
      "Description": "The X.509 certificate or AWS access key ID provided does not exist in our records."
    },
    {
      "Error code": "InvalidPaginationToken",
      "Description": "The specified pagination token is not valid or is expired."
    },
    {
      "Error code": "InvalidParameter",
      "Description": "A parameter specified in a request is not valid, is unsupported, or cannot be used. The returned message provides an explanation of the error value. For example, if you are launching an instance, you can't specify a security group and subnet that are in different VPCs."
    },
    {
      "Error code": "InvalidParameterCombination",
      "Description": "Indicates an incorrect combination of parameters, or a missing parameter. For example, trying to terminate an instance without specifying the instance ID."
    },
    {
      "Error code": "InvalidParameterValue",
      "Description": "A value specified in a parameter is not valid, is unsupported, or cannot be used. Ensure that you specify a resource by using its full ID. The returned message provides an explanation of the error value."
    },
    {
      "Error code": "InvalidQueryParameter",
      "Description": "The AWS query string is malformed or does not adhere to AWS standards."
    },
    {
      "Error code": "MalformedQueryString",
      "Description": "The query string contains a syntax error."
    },
    {
      "Error code": "MissingAction",
      "Description": "The request is missing an action or a required parameter."
    },
    {
      "Error code": "MissingAuthenticationToken",
      "Description": "The request must contain either a valid (registered) AWS access key ID or X.509 certificate."
    },
    {
      "Error code": "MissingParameter",
      "Description": "The request is missing a required parameter. Ensure that you have supplied all the required parameters for the request; for example, the resource ID."
    },
    {
      "Error code": "OptInRequired",
      "Description": "You are not authorized to use the requested service. Ensure that you have subscribed to the service you are trying to use. If you are new to AWS, your account might take some time to be activated while your credit card details are being verified."
    },
    {
      "Error code": "PendingVerification",
      "Description": "Your account is pending verification. Until the verification process is complete, you may not be able to carry out requests with this account. If you have questions, contact AWS Support."
    },
    {
      "Error code": "RequestExpired",
      "Description": "The request reached the service more than 15 minutes after the date stamp on the request or more than 15 minutes after the request expiration date (such as for presigned URLs), or the date stamp on the request is more than 15 minutes in the future. If you're using temporary security credentials, this error can also occur if the credentials have expired. For more information, see Temporary Security Credentials in the IAM User Guide."
    },
    {
      "Error code": "UnauthorizedOperation",
      "Description": "You are not authorized to perform this operation. Check your IAM policies, and ensure that you are using the correct access keys. For more information, see Controlling Access. If the returned message is encoded, you can decode it using the DecodeAuthorizationMessage action. For more information, see DecodeAuthorizationMessage in the AWS Security Token Service API Reference."
    },
    {
      "Error code": "UnknownParameter",
      "Description": "An unknown or unrecognized parameter was supplied. Requests that could cause this error include supplying a misspelled parameter or a parameter that is not supported for the specified API version."
    },
    {
      "Error code": "UnsupportedInstanceAttribute",
      "Description": "The specified attribute cannot be modified."
    },
    {
      "Error code": "UnsupportedOperation",
      "Description": "The specified request includes an unsupported operation. For example, you can't stop an instance that's instance store-backed. Or you might be trying to launch an instance type that is not supported by the specified AMI. The returned message provides details of the unsupported operation."
    },
    {
      "Error code": "UnsupportedProtocol",
      "Description": "SOAP has been deprecated and is no longer supported. For more information, see SOAP Requests."
    },
    {
      "Error code": "ValidationError",
      "Description": "The input fails to satisfy the constraints specified by an AWS service."
    }
  ],
  [
    {
      "Error code": "ActiveVpcPeeringConnectionPerVpcLimitExceeded",
      "Description": "You've reached the limit on the number of active VPC peering connections you can have for the specified VPC."
    },
    {
      "Error code": "AddressLimitExceeded",
      "Description": "You've reached the limit on the number of Elastic IP addresses that you can allocate. For more information, see Elastic IP Address Limit. If you need additional Elastic IP addresses, complete the Amazon EC2 Elastic IP Address Request Form. If you need additional Elastic IP addresses for your VPCs, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "AsnConflict",
      "Description": "The Autonomous System Numbers (ASNs) of the specified customer gateway and the specified virtual private gateway are the same."
    },
    {
      "Error code": "AttachmentLimitExceeded",
      "Description": "You've reached the limit on the number of Amazon EBS volumes or network interfaces that can be attached to a single instance."
    },
    {
      "Error code": "BootForVolumeTypeUnsupported",
      "Description": "The specified volume type cannot be used as a boot volume. For more information, see Amazon EBS Volume Types."
    },
    {
      "Error code": "BundlingInProgress",
      "Description": "The specified instance already has a bundling task in progress."
    },
    {
      "Error code": "CannotDelete",
      "Description": "You cannot delete the 'default' security group in your VPC, but you can change its rules. For more information, see Amazon EC2 Security Groups."
    },
    {
      "Error code": "ClientVpnAuthorizationRuleLimitExceeded",
      "Description": "You've reached the limit on the number of authorization rules that can be added to a single Client VPN endpoint."
    },
    {
      "Error code": "ClientVpnCertificateRevocationListLimitExceeded",
      "Description": "You've reached the limit on the number of client certificate revocation lists that can be added to a single Client VPN endpoint."
    },
    {
      "Error code": "ClientVpnEndpointAssociationExists",
      "Description": "The specified target network is already associated with the Client VPN endpoint."
    },
    {
      "Error code": "ClientVpnEndpointLimitExceeded",
      "Description": "You've reached the limit on the number of Client VPN endpoints that you can create."
    },
    {
      "Error code": "ClientVpnRouteLimitExceeded",
      "Description": "You've reached the limit on the number of routes that can be added to a single Client VPN endpoint."
    },
    {
      "Error code": "ClientVpnTerminateConnectionsLimitExceeded",
      "Description": "The number of client connections you're attempting to terminate exceeds the limit."
    },
    {
      "Error code": "CidrConflict",
      "Description": "You cannot enable a VPC for ClassicLink or extend a VPC peering connection to use the ClassicLink connection of a peer VPC if the VPC has routing that conflicts with the EC2-Classic private IP address range."
    },
    {
      "Error code": "ConcurrentSnapshotLimitExceeded",
      "Description": "You've reached the limit on the number of concurrent snapshots you can create on the specified volume. Wait until the 'pending' requests have completed, and check that you do not have snapshots that are in an incomplete state, such as 'error', which count against your concurrent snapshot limit."
    },
    {
      "Error code": "ConcurrentTagAccess",
      "Description": "You can't run simultaneous commands to modify a tag for a specific resource. Allow sufficient wait time for the previous request to complete, then retry your request. For more information, see Error Retries and Exponential Backoff in AWS."
    },
    {
      "Error code": "CreditSpecificationUpdateInProgress",
      "Description": "The default credit specification for the instance family is currently being updated. It takes about five minutes to complete. For more information, see Setting the Default Credit Specification for the Account."
    },
    {
      "Error code": "CustomerGatewayLimitExceeded",
      "Description": "You've reached the limit on the number of customer gateways you can create for the AWS Region. For more information, see Amazon VPC Limits. To request an increase on your customer gateway limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "CustomerKeyHasBeenRevoked",
      "Description": "The customer master key cannot be accessed. For more information, see Amazon EBS Encryption."
    },
    {
      "Error code": "DeleteConversionTaskError",
      "Description": "The conversion task cannot be canceled."
    },
    {
      "Error code": "DefaultSubnetAlreadyExistsInAvailabilityZone",
      "Description": "A default subnet already exists in the specified Availability Zone. You can have only one default subnet per Availability Zone."
    },
    {
      "Error code": "DefaultVpcAlreadyExists",
      "Description": "A default VPC already exists in the AWS Region. You can only have one default VPC per Region."
    },
    {
      "Error code": "DefaultVpcDoesNotExist",
      "Description": "There is no default VPC in which to carry out the request. If you've deleted your default VPC, you can create a new one. For more information, see Creating a Default VPC."
    },
    {
      "Error code": "DependencyViolation",
      "Description": "The specified object has dependent resources. A number of resources in a VPC may have dependent resources, which prevent you from deleting or detaching them. Remove the dependencies first, then retry your request. For example, this error occurs if you try to delete a security group in a VPC that is in use by another security group."
    },
    {
      "Error code": "DisallowedForDedicatedTenancyNetwork",
      "Description": "Dedicated tenancy VPCs cannot be used with ClassicLink. If you want to allow your dedicated tenancy VPC to be enabled for ClassicLink, contact AWS Support."
    },
    {
      "Error code": "DiskImageSizeTooLarge",
      "Description": "The disk image exceeds the allowed limit (for instance or volume import)."
    },
    {
      "Error code": "DuplicateSubnetsInSameZone",
      "Description": "For an interface VPC endpoint, you can specify only one subnet per Availability Zone."
    },
    {
      "Error code": "EIPMigratedToVpc",
      "Description": "The Elastic IP address has been migrated to EC2-VPC, and cannot be used in EC2-Classic."
    },
    {
      "Error code": "EncryptedVolumesNotSupported",
      "Description": "Encrypted Amazon EBS volumes may only be attached to instances that support Amazon EBS encryption. For more information, see Amazon EBS encryption in the Amazon EC2 User Guide for Linux Instances."
    },
    {
      "Error code": "ExistingVpcEndpointConnections",
      "Description": "You cannot delete a VPC endpoint service configuration or change the load balancers for the endpoint service if there are endpoints attached to the service."
    },
    {
      "Error code": "FleetNotInModifiableState",
      "Description": "The Spot Fleet request must be in the active state in order to modify it. For more information, see Modifying a Spot Fleet Request."
    },
    {
      "Error code": "FlowLogAlreadyExists",
      "Description": "A flow log with the specified configuration already exists."
    },
    {
      "Error code": "FlowLogsLimitExceeded",
      "Description": "You've reached the limit on the number of flow logs you can create. For more information, see Amazon VPC Limits."
    },
    {
      "Error code": "FilterLimitExceeded",
      "Description": "The request uses too many filters or too many filter values."
    },
    {
      "Error code": "Gateway.NotAttached",
      "Description": "An internet gateway is not attached to a VPC. If you are trying to detach an internet gateway, ensure that you specify the correct VPC. If you are trying to associate an Elastic IP address with a network interface or an instance, ensure that an internet gateway is attached to the relevant VPC."
    },
    {
      "Error code": "HostAlreadyCoveredByReservation",
      "Description": "The specified Dedicated Host is already covered by a reservation."
    },
    {
      "Error code": "HostLimitExceeded",
      "Description": "You've reached the limit on the number of Dedicated Hosts that you can allocate. For more information, see Dedicated Hosts."
    },
    {
      "Error code": "IdempotentInstanceTerminated",
      "Description": "The request to launch an instance uses the same client token as a previous request for which the instance has been terminated."
    },
    {
      "Error code": "InaccessibleStorageLocation",
      "Description": "The specified Amazon S3 URL cannot be accessed. Check the access permissions for the URL."
    },
    {
      "Error code": "IncorrectInstanceState",
      "Description": "The instance is in an incorrect state for the requested action. For example, some instance attributes, such as user data, can only be modified if the instance is in a 'stopped' state. If you are associating an Elastic IP address with a network interface, ensure that the instance that the interface is attached to is not in the 'pending' state."
    },
    {
      "Error code": "IncorrectModificationState",
      "Description": "A new modification action on an EBS Elastic Volume cannot occur because the volume is currently being modified."
    },
    {
      "Error code": "IncorrectState",
      "Description": "The resource is in an incorrect state for the request. This error can occur if you are trying to attach a volume that is still being created. Ensure that the volume is in the 'available' state. If you are creating a snapshot, ensure that the previous request to create a snapshot on the same volume has completed. If you are deleting a virtual private gateway, ensure that it's detached from the VPC."
    },
    {
      "Error code": "IncompatibleHostRequirements",
      "Description": "There are no available or compatible Dedicated Hosts available on which to launch or start the instance."
    },
    {
      "Error code": "InstanceAlreadyLinked",
      "Description": "The EC2-Classic instance you are trying to link is already linked to another VPC. You cannot link an EC2-Classic instance to more than one VPC at a time."
    },
    {
      "Error code": "InstanceCreditSpecification.NotSupported",
      "Description": "The specified instance does not use CPU credits for CPU usage; only T2 instances use CPU credits for CPU usage."
    },
    {
      "Error code": "InstanceLimitExceeded",
      "Description": "You've reached the limit on the number of instances you can run concurrently. This error can occur if you are launching an instance or if you are creating a Capacity Reservation. Capacity Reservations count towards your On-Demand Instance limits. If your request fails due to limit constraints, increase your On-Demand Instance limit for the required instance type and try again. For more information, see How many instances can I run in Amazon EC2. If you need additional instances, complete the Amazon EC2 Instance Request Form."
    },
    {
      "Error code": "InsufficientCapacityOnHost",
      "Description": "There is not enough capacity on the Dedicated Host to launch or start the instance."
    },
    {
      "Error code": "InsufficientFreeAddressesInSubnet",
      "Description": "The specified subnet does not contain enough free private IP addresses to fulfill your request. Use the DescribeSubnets request to view how many IP addresses are available (unused) in your subnet. IP addresses associated with stopped instances are considered unavailable."
    },
    {
      "Error code": "InsufficientReservedInstancesCapacity",
      "Description": "There is insufficient capacity for the requested Reserved Instances."
    },
    {
      "Error code": "InterfaceInUseByTrafficMirrorSession",
      "Description": "The Traffic Mirror source that you are trying to create uses an interface that is already associated with a session. An interface can only be associated with a session, or with a target, but not both."
    },
    {
      "Error code": "InterfaceInUseByTrafficMirrorTarget",
      "Description": "The Traffic Mirror source that you are trying to create uses an interface that is already associated with a target. An interface can only be associated with a session, or with a target, but not both. If the interface is associated with a target, it cannot be associated with another target."
    },
    {
      "Error code": "InternetGatewayLimitExceeded",
      "Description": "You've reached the limit on the number of internet gateways that you can create. For more information, see Amazon VPC Limits. To request an increase on the internet gateway limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "InvalidAddress.Locked",
      "Description": "The specified Elastic IP address cannot be released from your account. A reverse DNS record may be associated with the Elastic IP address. To unlock the address, contact AWS Support."
    },
    {
      "Error code": "InvalidAddress.Malformed",
      "Description": "The specified IP address is not valid. Ensure that you provide the address in the form xx.xx.xx.xx; for example, 55.123.45.67"
    },
    {
      "Error code": "InvalidAddress.NotFound",
      "Description": "The specified Elastic IP address that you are describing cannot be found. Ensure that you specify the AWS Region in which the IP address is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidAddressID.NotFound",
      "Description": "The specified allocation ID for the Elastic IP address you are trying to release cannot be found. Ensure that you specify the AWS Region in which the IP address is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidAffinity",
      "Description": "The specified affinity value is not valid."
    },
    {
      "Error code": "InvalidAllocationID.NotFound",
      "Description": "The specified allocation ID you are trying to describe or associate does not exist. Ensure that you specify the AWS Region in which the IP address is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidAMIAttributeItemValue",
      "Description": "The value of an item added to, or removed from, an image attribute is not valid. If you are specifying a userId, check that it is in the form of an AWS account ID, without hyphens."
    },
    {
      "Error code": "InvalidAMIID.Malformed",
      "Description": "The specified AMI ID is malformed. Ensure that you provide the full AMI ID, in the form ami-xxxxxxxx."
    },
    {
      "Error code": "InvalidAMIID.NotFound",
      "Description": "The specified AMI does not exist. Check the AMI ID, and ensure that you specify the AWS Region in which the AMI is located, if it's not in the default Region. This error may also occur if you specified an incorrect kernel ID when launching an instance."
    },
    {
      "Error code": "InvalidAMIID.Unavailable",
      "Description": "The specified AMI has been deregistered and is no longer available, or is not in a state from which you can launch an instance or modify attributes."
    },
    {
      "Error code": "InvalidAMIName.Duplicate",
      "Description": "The specified AMI name is already in use by another AMI. If you have recently deregistered an AMI with the same name, allow enough time for the change to propagate through the system, and retry your request."
    },
    {
      "Error code": "InvalidAMIName.Malformed",
      "Description": "AMI names must be between 3 and 128 characters long, and may only contain letters, numbers, and the following special characters: '-', '_', '.', '/', '(', and ')'."
    },
    {
      "Error code": "InvalidAssociationID.NotFound",
      "Description": "The specified association ID (for an Elastic IP address, a route table, or network ACL) does not exist. Ensure that you specify the AWS Region in which the association ID is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidAttachment.NotFound",
      "Description": "Indicates an attempt to detach a volume from an instance to which it is not attached."
    },
    {
      "Error code": "InvalidAttachmentID.NotFound",
      "Description": "The specified network interface attachment does not exist."
    },
    {
      "Error code": "InvalidAutoPlacement",
      "Description": "The specified value for auto-placement is not valid."
    },
    {
      "Error code": "InvalidAvailabilityZone",
      "Description": "The specified Availability Zone is not valid."
    },
    {
      "Error code": "InvalidBlockDeviceMapping",
      "Description": "A block device mapping parameter is not valid. The returned message indicates the incorrect value."
    },
    {
      "Error code": "InvalidBundleID.NotFound",
      "Description": "The specified bundle task ID cannot be found. Ensure that you specify the AWS Region in which the bundle task is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidCidr.InUse",
      "Description": "The specified inside tunnel CIDR is already in use by another VPN tunnel for the virtual private gateway."
    },
    {
      "Error code": "InvalidClientToken",
      "Description": "The specified client token is not valid. For more information, see Idempotency in Amazon EC2."
    },
    {
      "Error code": "InvalidClientVpnAssociationIdNotFound",
      "Description": "The specified target network association cannot be found."
    },
    {
      "Error code": "InvalidClientVpnConnection.IdNotFound",
      "Description": "The specified Client VPN endpoint cannot be found."
    },
    {
      "Error code": "InvalidClientVpnConnection.UserNotFound",
      "Description": "The specified user does not have an active connection to the specified Client VPN endpoint."
    },
    {
      "Error code": "InvalidClientVpnDuplicateAssociationException",
      "Description": "The specified target network has already been associated with the Client VPN endpoint."
    },
    {
      "Error code": "InvalidClientVpnDuplicateAuthorizationRule",
      "Description": "The specified authorization has already been added to the Client VPN endpoint."
    },
    {
      "Error code": "InvalidClientVpnDuplicateRoute",
      "Description": "The specified route has already been added to the Client VPN endpoint."
    },
    {
      "Error code": "InvalidClientVpnEndpointAuthorizationRuleNotFound",
      "Description": "The specified authorization rule cannot be found."
    },
    {
      "Error code": "InvalidClientVpnRouteNotFound",
      "Description": "The specified route cannot be found."
    },
    {
      "Error code": "InvalidClientVpnSubnetId.DifferentAccount",
      "Description": "The specified subnet belongs to a different account."
    },
    {
      "Error code": "InvalidClientVpnSubnetId.DuplicateAz",
      "Description": "You have already associated a subnet from this Availability Zone with the Client VPN endpoint."
    },
    {
      "Error code": "InvalidClientVpnSubnetId.NotFound",
      "Description": "The specified subnet cannot be found in the VPN with which the Client VPN endpoint is associated."
    },
    {
      "Error code": "InvalidClientVpnSubnetId.OverlappingCidr",
      "Description": "The specified target network's CIDR range overlaps with the Client VPN endpoint's client CIDR range."
    },
    {
      "Error code": "InvalidClientVpnActiveAssociationNotFound",
      "Description": "You cannot perform this action on the Client VPN endpoint while it is in the pending-association state."
    },
    {
      "Error code": "InvalidClientVpnEndpointId.NotFound",
      "Description": "The specified Client VPN Endpoint cannot be found."
    },
    {
      "Error code": "InvalidConversionTaskId",
      "Description": "The specified conversion task ID (for instance or volume import) is not valid."
    },
    {
      "Error code": "InvalidConversionTaskId.Malformed",
      "Description": "The specified conversion task ID (for instance or volume import) is malformed. Ensure that you've specified the ID in the form import-i-xxxxxxxx."
    },
    {
      "Error code": "InvalidCpuCredits.Malformed",
      "Description": "The specified CpuCredit value is invalid. Valid values are standard and unlimited."
    },
    {
      "Error code": "InvalidCustomerGateway.DuplicateIpAddress",
      "Description": "There is a conflict among the specified gateway IP addresses. Each VPN connection in an AWS Region must be created with a unique customer gateway IP address (across all AWS accounts). For more information, see Your Customer Gateway in the AWS Site-to-Site VPN Network Administrator Guide."
    },
    {
      "Error code": "InvalidCustomerGatewayId.Malformed",
      "Description": "The specified customer gateway ID is malformed, or cannot be found. Specify the ID in the form cgw-xxxxxxxx, and ensure that you specify the AWS Region in which the customer gateway is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidCustomerGatewayID.NotFound",
      "Description": "The specified customer gateway ID cannot be found. Ensure that you specify the AWS Region in which the customer gateway is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidCustomerGatewayState",
      "Description": "The customer gateway is not in the available state, and therefore cannot be used."
    },
    {
      "Error code": "InvalidDevice.InUse",
      "Description": "The device to which you are trying to attach (for example, /dev/sdh) is already in use on the instance."
    },
    {
      "Error code": "InvalidDhcpOptionID.NotFound",
      "Description": "The specified DHCP options set does not exist. Ensure that you specify the AWS Region in which the DHCP options set is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidDhcpOptionsID.NotFound",
      "Description": "The specified DHCP options set does not exist. Ensure that you specify the AWS Region in which the DHCP options set is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidDhcpOptionsId.Malformed",
      "Description": "The specified DHCP options set ID is malformed. Ensure that you provide the full DHCP options set ID in the request, in the form dopt-xxxxxxxx."
    },
    {
      "Error code": "InvalidExportTaskID.NotFound",
      "Description": "The specified export task ID cannot be found."
    },
    {
      "Error code": "InvalidFilter",
      "Description": "The specified filter is not valid."
    },
    {
      "Error code": "InvalidFlowLogId.NotFound",
      "Description": "The specified flow log does not exist. Ensure that you have indicated the AWS Region in which the flow log is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidFormat",
      "Description": "The specified disk format (for the instance or volume import) is not valid."
    },
    {
      "Error code": "InvalidFpgaImageID.Malformed",
      "Description": "The specified Amazon FPGA image (AFI) ID is malformed. Ensure that you provide the full AFI ID in the request, in the form afi-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidFpgaImageID.NotFound",
      "Description": "The specified Amazon FPGA image (AFI) ID does not exist. Ensure that you specify the AWS Region in which the AFI is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidGatewayID.NotFound",
      "Description": "The specified gateway does not exist."
    },
    {
      "Error code": "InvalidGroup.Duplicate",
      "Description": "You cannot create a security group with the same name as an existing security group in the same VPC, or the same AWS Region (EC2-Classic)."
    },
    {
      "Error code": "InvalidGroupId.Malformed",
      "Description": "The specified security group ID is malformed. Ensure that you provide the full security group ID in the request, in the form sg-xxxxxxxx."
    },
    {
      "Error code": "InvalidGroup.InUse",
      "Description": "The specified security group can't be deleted because it's in use by another security group. You can remove dependencies by modifying or deleting rules in the affected security groups."
    },
    {
      "Error code": "InvalidGroup.NotFound",
      "Description": "The specified security group does not exist. This error can occur because the ID of a recently created security group has not propagated through the system. For more information, see Eventual consistency. You can't specify a security group that is in a different AWS Region or VPC than the request."
    },
    {
      "Error code": "InvalidGroup.Reserved",
      "Description": "The name 'default' is reserved, and cannot be used to create a new security group. You also cannot delete the default EC2-Classic security group, but you can change its rules. For more information, see Amazon EC2 Security Groups."
    },
    {
      "Error code": "InvalidHostConfiguration",
      "Description": "The specified Dedicated Host configuration is not supported."
    },
    {
      "Error code": "InvalidHostId",
      "Description": "The specified Dedicated Host ID is not valid."
    },
    {
      "Error code": "InvalidHostID.Malformed",
      "Description": "The specified Dedicated Host ID is not formed correctly. Ensure that you provide the full ID in the form h-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidHostId.Malformed",
      "Description": "The specified Dedicated Host ID is not formed correctly. Ensure that you provide the full ID in the form h-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidHostID.NotFound",
      "Description": "The specified Dedicated Host ID does not exist. Ensure that you specify the AWS Region in which the Dedicated Host is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidHostId.NotFound",
      "Description": "The specified Dedicated Host ID does not exist. Ensure that you specify the region in which the Dedicated Host is located, if it's not in the default region."
    },
    {
      "Error code": "InvalidHostReservationId.Malformed",
      "Description": "The specified Dedicated Host Reservation ID is not formed correctly. Ensure that you provide the full ID in the form hr-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidHostReservationOfferingId.Malformed",
      "Description": "The specified Dedicated Host Reservation offering is not formed correctly. Ensure that you provide the full ID in the form hro-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidHostState",
      "Description": "The Dedicated Host must be in the available state to complete the operation."
    },
    {
      "Error code": "InvalidIamInstanceProfileArn.Malformed",
      "Description": "The specified IAM instance profile ARN is not valid. For more information about valid ARN formats, see Amazon Resource Names (ARNs) and AWS Service Namespaces."
    },
    {
      "Error code": "InvalidID",
      "Description": "The specified ID for the resource you are trying to tag is not valid. Ensure that you provide the full resource ID; for example, ami-2bb65342 for an AMI. If you're using the command line tools on a Windows system, you might need to use quotation marks for the key-value pair; for example, \"Name=TestTag\"."
    },
    {
      "Error code": "InvalidInput",
      "Description": "An input parameter in the request is not valid. For example, you may have specified an incorrect Reserved Instance listing ID in the request or the Reserved Instance you tried to list cannot be sold in the Reserved Instances Marketplace (for example, if it has a scope of Region, or is a Convertible Reserved Instance)."
    },
    {
      "Error code": "InvalidInstanceAttributeValue",
      "Description": "The specified instance attribute value is not valid. This error is most commonly encountered when trying to set the InstanceType/--instance-type attribute to an unrecognized value."
    },
    {
      "Error code": "InvalidInstanceCreditSpecification.DuplicateInstanceId",
      "Description": "If you are modifying the credit option for CPU usage for T2 instances, the request may not contain duplicate instance IDs."
    },
    {
      "Error code": "InvalidInstanceFamily",
      "Description": "The instance family is not supported for this request. For example, the instance family for the Dedicated Host Reservation offering is different from the instance family of the Dedicated Hosts. Or, you can only modify the default credit specification for burstable performance instance families (T2, T3, and T3a). For more information, see Setting the Default Credit Specification for the Account."
    },
    {
      "Error code": "InvalidInstanceID",
      "Description": "This error commonly occurs when trying to associate an IP address with an instance that is not in the 'running' state. This error can also occur when trying to perform an operation on an instance that has multiple network interfaces. A network interface can have individual attributes; therefore, you may need to specify the network interface ID as part of the request, or use a different request. For example, each network interface in an instance can have a source/destination check flag. To modify this attribute, modify the network interface attribute, and not the instance attribute. To create a route in a route table, provide a specific network interface ID as part of the request."
    },
    {
      "Error code": "InvalidInstanceID.Malformed",
      "Description": "The specified instance ID is malformed. Ensure that you provide the full instance ID in the request, in the form i-xxxxxxxx or i-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidInstanceID.NotFound",
      "Description": "The specified instance does not exist. Ensure that you have indicated the AWS Region in which the instance is located, if it's not in the default Region. This error may occur because the ID of a recently created instance has not propagated through the system. For more information, see Eventual consistency."
    },
    {
      "Error code": "InvalidInstanceID.NotLinkable",
      "Description": "The specified instance cannot be linked to the specified VPC. Ensure that the instance is an EC2-Classic instance. This error may also occur if the instance was recently launched, and its ID has not yet propagated through the system. Wait a few minutes, or wait until the instance is in the running state, and then try again."
    },
    {
      "Error code": "InvalidInstanceState",
      "Description": "The instance is not in an appropriate state to complete the request. If you're modifying the instance placement, the instance must be in the stopped state."
    },
    {
      "Error code": "InvalidInstanceType",
      "Description": "The instance type is not supported for this request. For example, you can only bundle instance store-backed Windows instances."
    },
    {
      "Error code": "InvalidInterface.IpAddressLimitExceeded",
      "Description": "The number of private IP addresses for a specified network interface exceeds the limit for the type of instance you are trying to launch. For more information about the maximum number of private IP addresses per elastic network interface, see Private IP addresses per Elastic Network Interface."
    },
    {
      "Error code": "InvalidInternetGatewayId.Malformed",
      "Description": "The specified internet gateway ID is malformed. Ensure that you provide the full ID in the request, in the form igw-xxxxxxxx."
    },
    {
      "Error code": "InvalidInternetGatewayID.NotFound",
      "Description": "The specified internet gateway does not exist. Ensure that you specify the AWS Region in which the internet gateway is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidIPAddress.InUse",
      "Description": "The specified IP address is already in use. If you are trying to release an address, you must first disassociate it from the instance."
    },
    {
      "Error code": "InvalidKernelId.Malformed",
      "Description": "The specified kernel ID is not valid. Ensure that you specify the kernel ID in the form aki-xxxxxxxx."
    },
    {
      "Error code": "InvalidKey.Format",
      "Description": "The key pair is not specified in a valid OpenSSH public key format."
    },
    {
      "Error code": "InvalidKeyPair.Duplicate",
      "Description": "The key pair name already exists in that AWS Region. If you are creating or importing a key pair, ensure that you use a unique name."
    },
    {
      "Error code": "InvalidKeyPair.Format",
      "Description": "The format of the public key you are attempting to import is not valid."
    },
    {
      "Error code": "InvalidKeyPair.NotFound",
      "Description": "The specified key pair name does not exist. Ensure that you specify the AWS Region in which the key pair is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidCapacityReservationIdMalformedException",
      "Description": "The ID for the Capacity Reservation is malformed. Ensure that you specify the Capacity Reservation ID in the form cr-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidCapacityReservationIdNotFoundException",
      "Description": "The specified Capacity Reservation ID does not exist."
    },
    {
      "Error code": "InvalidLaunchTemplateId.Malformed",
      "Description": "The ID for the launch template is malformed. Ensure that you specify the launch template ID in the form lt-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "InvalidLaunchTemplateId.NotFound",
      "Description": "The specified launch template ID does not exist. Ensure that you specify the AWS Region in which the launch template is located."
    },
    {
      "Error code": "InvalidLaunchTemplateId.VersionNotFound",
      "Description": "The specified launch template version does not exist."
    },
    {
      "Error code": "InvalidLaunchTemplateName.AlreadyExistsException",
      "Description": "The specified launch template name is already in use."
    },
    {
      "Error code": "InvalidLaunchTemplateName.MalformedException",
      "Description": "The specified launch template name is invalid. A launch template name must be between 3 and 128 characters, and may contain letters, numbers, and the following characters: '-', '_', '.', '/', '(', and ')'."
    },
    {
      "Error code": "InvalidLaunchTemplateName.NotFoundException",
      "Description": "The specified launch template name does not exist. Check the spelling of the name and ensure that you specify the AWS Region in which the launch template is located. Launch template names are case-sensitive."
    },
    {
      "Error code": "InvalidManifest",
      "Description": "The specified AMI has an unparsable manifest, or you may not have access to the location of the manifest file in Amazon S3."
    },
    {
      "Error code": "InvalidMaxResults",
      "Description": "The specified value for MaxResults is not valid."
    },
    {
      "Error code": "InvalidNatGatewayID.NotFound",
      "Description": "The specified NAT gateway ID does not exist. Ensure that you specify the AWS Region in which the NAT gateway is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidNetworkAclEntry.NotFound",
      "Description": "The specified network ACL entry does not exist."
    },
    {
      "Error code": "InvalidNetworkAclId.Malformed",
      "Description": "The specified network ACL ID is malformed. Ensure that you provide the ID in the form acl-xxxxxxxx."
    },
    {
      "Error code": "InvalidNetworkAclID.NotFound",
      "Description": "The specified network ACL does not exist. Ensure that you specify the AWS Region in which the network ACL is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidNetworkLoadBalancerArn.Malformed",
      "Description": "The specified Network Load Balancer ARN is malformed. Ensure that you specify the ARN in the form arn:aws:elasticloadbalancing:region:account-id:loadbalancer/net/load-balancer-name/load-balancer-id."
    },
    {
      "Error code": "InvalidNetworkLoadBalancerArn.NotFound",
      "Description": "The specified Network Load Balancer ARN does not exist."
    },
    {
      "Error code": "InvalidNetworkInterfaceAttachmentId.Malformed",
      "Description": "The ID for the network interface attachment is malformed. Ensure that you use the attachment ID rather than the network interface ID, in the form eni-attach-xxxxxxxx."
    },
    {
      "Error code": "InvalidNetworkInterface.InUse",
      "Description": "The specified interface is currently in use and cannot be deleted or attached to another instance. Ensure that you have detached the network interface first. If a network interface is in use, you may also receive the InvalidParameterValue error."
    },
    {
      "Error code": "InvalidNetworkInterfaceId.Malformed",
      "Description": "The specified network interface ID is malformed. Ensure that you specify the network interface ID in the form eni-xxxxxxxx."
    },
    {
      "Error code": "InvalidNetworkInterfaceID.NotFound",
      "Description": "The specified network interface does not exist. Ensure that you specify the AWS Region in which the network interface is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidNextToken",
      "Description": "The specified NextToken is not valid."
    },
    {
      "Error code": "InvalidOption.Conflict",
      "Description": "A VPN connection between the virtual private gateway and the customer gateway already exists."
    },
    {
      "Error code": "InvalidPermission.Duplicate",
      "Description": "The specified inbound or outbound rule already exists for that security group."
    },
    {
      "Error code": "InvalidPermission.Malformed",
      "Description": "The specified security group rule is malformed. If you are specifying an IP address range, ensure that you use CIDR notation; for example, 203.0.113.0/24."
    },
    {
      "Error code": "InvalidPermission.NotFound",
      "Description": "The specified rule does not exist in this security group."
    },
    {
      "Error code": "InvalidPlacementGroup.Duplicate",
      "Description": "The specified placement group already exists in that AWS Region."
    },
    {
      "Error code": "InvalidPlacementGroup.InUse",
      "Description": "The specified placement group is in use. If you are trying to delete a placement group, ensure that its instances have been terminated."
    },
    {
      "Error code": "InvalidPlacementGroup.Unknown",
      "Description": "The specified placement group cannot be found. Ensure that you specify the AWS Region in which the placement group is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidPolicyDocument",
      "Description": "The specified policy document is not a valid JSON policy document."
    },
    {
      "Error code": "InvalidPrefixListId.Malformed",
      "Description": "The specified prefix list ID is malformed. Ensure that you provide the ID in the form pl-xxxxxxxx."
    },
    {
      "Error code": "InvalidPrefixListId.NotFound",
      "Description": "The specified prefix list ID does not exist. Ensure that you have indicated the AWS Region for the service, if it's not in the default Region."
    },
    {
      "Error code": "InvalidProductInfo",
      "Description": "(AWS Marketplace) The product code is not valid."
    },
    {
      "Error code": "InvalidPurchaseToken.Expired",
      "Description": "The specified purchase token has expired."
    },
    {
      "Error code": "InvalidPurchaseToken.Malformed",
      "Description": "The specified purchase token is not valid."
    },
    {
      "Error code": "InvalidQuantity",
      "Description": "The specified quantity of Dedicated Hosts is not valid."
    },
    {
      "Error code": "InvalidRamDiskId.Malformed",
      "Description": "The specified RAM disk ID is not valid. Ensure that you specify the RAM disk ID in the form ari-xxxxxxxx."
    },
    {
      "Error code": "InvalidRegion",
      "Description": "The specified AWS Region is not valid. For copying a snapshot or image, specify the source Region using its Region code, for example, us-west-2."
    },
    {
      "Error code": "InvalidRequest",
      "Description": "The request is not valid. The returned message provides details about the nature of the error."
    },
    {
      "Error code": "InvalidReservationID.Malformed",
      "Description": "The specified reservation ID is not valid."
    },
    {
      "Error code": "InvalidReservationID.NotFound",
      "Description": "The specified reservation does not exist."
    },
    {
      "Error code": "InvalidReservedInstancesId",
      "Description": "The specified Reserved Instance does not exist."
    },
    {
      "Error code": "InvalidReservedInstancesOfferingId",
      "Description": "The specified Reserved Instances offering does not exist."
    },
    {
      "Error code": "InvalidResourceType.Unknown",
      "Description": "The specified resource type is not supported or is not valid. To view resource types that support longer IDs, use DescribeIdFormat."
    },
    {
      "Error code": "InvalidRoute.InvalidState",
      "Description": "The specified route is not valid."
    },
    {
      "Error code": "InvalidRoute.Malformed",
      "Description": "The specified route is not valid. If you are deleting a route in a VPN connection, ensure that you've entered the value for the CIDR block correctly."
    },
    {
      "Error code": "InvalidRoute.NotFound",
      "Description": "The specified route does not exist in the specified route table. Ensure that you indicate the exact CIDR range for the route in the request. This error can also occur if you've specified a route table ID in the request that does not exist."
    },
    {
      "Error code": "InvalidRouteTableId.Malformed",
      "Description": "The specified route table ID is malformed. Ensure that you specify the route table ID in the form rtb-xxxxxxxx."
    },
    {
      "Error code": "InvalidRouteTableID.NotFound",
      "Description": "The specified route table does not exist. Ensure that you specify the AWS Region in which the route table is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidScheduledInstance",
      "Description": "The specified Scheduled Instance does not exist."
    },
    {
      "Error code": "InvalidSecurityGroupId.Malformed",
      "Description": "The specified security group ID is not valid. Ensure that you specify the security group ID in the form sg-xxxxxxxx."
    },
    {
      "Error code": "InvalidSecurityGroupID.NotFound",
      "Description": "The specified security group does not exist. If you are creating a network interface, ensure that you specify a VPC security group, and not an EC2-Classic security group."
    },
    {
      "Error code": "InvalidSecurity.RequestHasExpired",
      "Description": "The difference between the request timestamp and the AWS server time is greater than 5 minutes. Ensure that your system clock is accurate and configured to use the correct time zone."
    },
    {
      "Error code": "InvalidServiceName",
      "Description": "The name of the service is not valid. To get a list of available service names, use DescribeVpcEndpointServices."
    },
    {
      "Error code": "InvalidSnapshotID.Malformed",
      "Description": "The snapshot ID is not valid."
    },
    {
      "Error code": "InvalidSnapshot.InUse",
      "Description": "The snapshot that you are trying to delete is in use by one or more AMIs."
    },
    {
      "Error code": "InvalidSnapshot.NotFound",
      "Description": "The specified snapshot does not exist. Ensure that you specify the AWS Region in which the snapshot is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidSpotDatafeed.NotFound",
      "Description": "You have no data feed for Spot Instances."
    },
    {
      "Error code": "InvalidSpotFleetRequestConfig",
      "Description": "The Spot Fleet request configuration is not valid. Ensure that you provide valid values for all of the configuration parameters; for example, a valid AMI ID. Limits apply on the target capacity and the number of launch specifications per Spot Fleet request. For more information, see Spot Fleet Limits."
    },
    {
      "Error code": "InvalidSpotFleetRequestId.Malformed",
      "Description": "The specified Spot Fleet request ID is malformed. Ensure that you specify the Spot Fleet request ID in the form sfr- followed by 36 characters, including hyphens; for example, sfr-123f8fc2-11aa-22bb-33cc-example12710."
    },
    {
      "Error code": "InvalidSpotFleetRequestId.NotFound",
      "Description": "The specified Spot Fleet request ID does not exist. Ensure that you specify the AWS Region in which the Spot Fleet request is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidSpotInstanceRequestID.Malformed",
      "Description": "The specified Spot Instance request ID is not valid. Ensure that you specify the Spot Instance request ID in the form sir-xxxxxxxx."
    },
    {
      "Error code": "InvalidSpotInstanceRequestID.NotFound",
      "Description": "The specified Spot Instance request ID does not exist. Ensure that you specify the AWS Region in which the Spot Instance request is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidState",
      "Description": "The specified resource is not in the correct state for the request; for example, if you are trying to enable monitoring on a recently terminated instance, or if you are trying to create a snapshot when a previous identical request has not yet completed."
    },
    {
      "Error code": "InvalidStateTransition",
      "Description": "The specified VPC peering connection is not in the correct state for the request. For example, you may be trying to accept a VPC peering request that has failed, or that was rejected."
    },
    {
      "Error code": "InvalidSubnet",
      "Description": "The specified subnet ID is not valid or does not exist."
    },
    {
      "Error code": "InvalidSubnet.Conflict",
      "Description": "The specified CIDR block conflicts with that of another subnet in your VPC."
    },
    {
      "Error code": "InvalidSubnetID.Malformed",
      "Description": "The specified subnet ID is malformed. Ensure that you specify the ID in the form subnet-xxxxxxxx"
    },
    {
      "Error code": "InvalidSubnetID.NotFound",
      "Description": "The specified subnet does not exist. Ensure that you have indicated the AWS Region in which the subnet is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidSubnet.Range",
      "Description": "The CIDR block you've specified for the subnet is not valid. The allowed block size is between a /28 netmask and /16 netmask."
    },
    {
      "Error code": "InvalidTagKey.Malformed",
      "Description": "The specified tag key is not valid. Tag keys cannot be empty or null, and cannot start with aws:."
    },
    {
      "Error code": "InvalidTargetArn.Unknown",
      "Description": "The specified ARN for the IAM user, IAM role, or root user is not valid or does not exist."
    },
    {
      "Error code": "InvalidTenancy",
      "Description": "The tenancy of the instance or VPC is not supported for the requested action. For example, you cannot modify the tenancy of an instance or VPC that has a tenancy attribute of default."
    },
    {
      "Error code": "InvalidTime",
      "Description": "The specified timestamp is not valid."
    },
    {
      "Error code": "InvalidTrafficMirrorFilterNotFound",
      "Description": "The specified Traffic Mirror filter does not exist."
    },
    {
      "Error code": "InvalidTrafficMirrorFilterRuleNotFound",
      "Description": "The specified Traffic Mirror filter rule does not exist."
    },
    {
      "Error code": "InvalidTrafficMirrorSessionNotFound",
      "Description": "The specified Traffic Mirror session does not exist."
    },
    {
      "Error code": "InvalidTrafficMirrorTargetNoFound",
      "Description": "The specified Traffic Mirror target does not exist."
    },
    {
      "Error code": "InvalidUserID.Malformed",
      "Description": "The specified user or owner is not valid. If you are performing a DescribeImages request, you must specify a valid value for the owner or executableBy parameters, such as an AWS account ID. If you are performing a DescribeSnapshots request, you must specify a valid value for the owner or restorableBy parameters."
    },
    {
      "Error code": "InvalidVolumeID.Duplicate",
      "Description": "The Amazon EBS volume already exists."
    },
    {
      "Error code": "InvalidVolumeID.Malformed",
      "Description": "The specified volume ID is not valid. Check the letter-number combination carefully."
    },
    {
      "Error code": "InvalidVolumeID.ZoneMismatch",
      "Description": "The specified volume and instance are in different Availability Zones."
    },
    {
      "Error code": "InvalidVolume.NotFound",
      "Description": "The specified volume does not exist. Ensure that you have indicated the AWS Region in which the volume is located, if it's not in the default Region. Ensure that you are using the correct access credentials."
    },
    {
      "Error code": "InvalidVolume.ZoneMismatch",
      "Description": "The specified volume is not in the same Availability Zone as the specified instance. You can only attach an Amazon EBS volume to an instance if they are in the same Availability Zone."
    },
    {
      "Error code": "InvalidVpcEndpointId.Malformed",
      "Description": "The specified VPC endpoint ID is malformed. Use the full VPC endpoint ID in the request, in the form vpce-xxxxxxxx."
    },
    {
      "Error code": "InvalidVpcEndpoint.NotFound",
      "Description": "The specified VPC endpoint does not exist. If you are performing a bulk request that is partially successful or unsuccessful, the response includes a list of the unsuccessful items. If the request succeeds, the list is empty."
    },
    {
      "Error code": "InvalidVpcEndpointId.NotFound",
      "Description": "The specified VPC endpoint does not exist. If you are performing a bulk request that is partially successful or unsuccessful, the response includes a list of the unsuccessful items. If the request succeeds, the list is empty."
    },
    {
      "Error code": "InvalidVpcEndpointService.NotFound",
      "Description": "The specified VPC endpoint service does not exist. If you are performing a bulk request that is partially successful or unsuccessful, the response includes a list of the unsuccessful items. If the request succeeds, the list is empty."
    },
    {
      "Error code": "InvalidVpcEndpointServiceId.NotFound",
      "Description": "The specified VPC endpoint service does not exist. If you are performing a bulk request that is partially successful or unsuccessful, the response includes a list of the unsuccessful items. If the request succeeds, the list is empty."
    },
    {
      "Error code": "InvalidVpcEndpointType",
      "Description": "The specified VPC endpoint type is not valid. Valid values are Interface and Gateway."
    },
    {
      "Error code": "InvalidVpcID.Malformed",
      "Description": "The specified VPC ID is malformed. Ensure that you've specified the ID in the form vpc-xxxxxxxx."
    },
    {
      "Error code": "InvalidVpcID.NotFound",
      "Description": "The specified VPC does not exist. Ensure that you have indicated the AWS Region in which the VPC is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidVpcPeeringConnectionId.Malformed",
      "Description": "The specified VPC peering connection ID is malformed. Ensure that you provide the ID in the form pcx-xxxxxxxx."
    },
    {
      "Error code": "InvalidVpcPeeringConnectionID.NotFound",
      "Description": "The specified VPC peering connection ID does not exist. Ensure that you have indicated the AWS Region in which the VPC peering connection is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidVpcPeeringConnectionState.DnsHostnamesDisabled",
      "Description": "To enable DNS hostname resolution for the VPC peering connection, DNS hostname support must be enabled for the VPCs."
    },
    {
      "Error code": "InvalidVpcRange",
      "Description": "The specified CIDR block range is not valid. The block range must be between a /28 netmask and /16 netmask. For more information, see Your VPC and Subnets."
    },
    {
      "Error code": "InvalidVpcState",
      "Description": "The specified VPC already has a virtual private gateway attached to it."
    },
    {
      "Error code": "InvalidVpnConnectionID",
      "Description": "The specified VPN connection ID cannot be found. Ensure that you have indicated the AWS Region in which the VPN connection ID is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidVpnConnectionID.NotFound",
      "Description": "The specified VPN connection ID does not exist. Ensure that you have indicated the AWS Region in which the VPN connection ID is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidVpnConnection.InvalidState",
      "Description": "The VPN connection must be in the available state to complete the request."
    },
    {
      "Error code": "InvalidVpnConnection.InvalidType",
      "Description": "The specified VPN connection does not support static routes."
    },
    {
      "Error code": "InvalidVpnGatewayAttachment.NotFound",
      "Description": "An attachment between the specified virtual private gateway and specified VPC does not exist. This error can also occur if you've specified an incorrect VPC ID in the request."
    },
    {
      "Error code": "InvalidVpnGatewayID.NotFound",
      "Description": "The specified virtual private gateway does not exist. Ensure that you have indicated the AWS Region in which the virtual private gateway is located, if it's not in the default Region."
    },
    {
      "Error code": "InvalidVpnGatewayState",
      "Description": "The virtual private gateway is not in an available state."
    },
    {
      "Error code": "InvalidZone.NotFound",
      "Description": "The specified Availability Zone does not exist, or is not available for you to use. Use the DescribeAvailabilityZones request to list the Availability Zones that are currently available to you. Ensure that you have indicated the AWS Region for the Availability Zone in the request, if it's not in the default Region. Specify the full name of the Availability Zone: for example, us-east-1a."
    },
    {
      "Error code": "KeyPairLimitExceeded",
      "Description": "You've reached the limit on the number of key pairs that you can have in this AWS Region. For more information, see Amazon EC2 Key Pairs."
    },
    {
      "Error code": "LegacySecurityGroup",
      "Description": "Any VPC created using an API version older than 2011-01-01 may have the 2009-07-15-default security group. You must delete this security group before you can attach an internet gateway to the VPC."
    },
    {
      "Error code": "LimitPriceExceeded",
      "Description": "The cost of the total order is greater than the specified limit price (instance count * price)."
    },
    {
      "Error code": "LogDestinationNotFoundException",
      "Description": "The specified Amazon S3 bucket does not exist. Ensure that you have specified the ARN for an existing Amazon S3 bucket, and that the ARN is in the correct format."
    },
    {
      "Error code": "LogDestinationPermissionIssue",
      "Description": "You do not have sufficient permissions to publish flow logs to the specific Amazon S3 bucket."
    },
    {
      "Error code": "MaxIOPSLimitExceeded",
      "Description": "You've reached the limit on your IOPS usage for that AWS Region. To increase your volume limit, complete the Amazon EC2 EBS Volume Limit Form."
    },
    {
      "Error code": "MaxScheduledInstanceCapacityExceeded",
      "Description": "You've attempted to launch more instances than you purchased."
    },
    {
      "Error code": "MaxSpotFleetRequestCountExceeded",
      "Description": "You've reached one or both of these limits: the total number of Spot Fleet requests that you can make, or the total number of instances in all Spot Fleets for the AWS Region (the target capacity). For more information, see Spot Fleet Limits."
    },
    {
      "Error code": "MaxSpotInstanceCountExceeded",
      "Description": "You've reached the limit on the number of Spot Instances that you can launch. The limit depends on the instance type. For more information, see How many instances can I run in Amazon EC2. If you need additional instances, complete the Amazon EC2 Instance Request Form."
    },
    {
      "Error code": "MaxTemplateLimitExceeded",
      "Description": "You've reached the limit on the number of launch templates you can create. For more information, see Launch Template Restrictions ."
    },
    {
      "Error code": "MaxTemplateVersionLimitExceeded",
      "Description": "You've reached the limit on the number of launch template versions you can create. For more information, see Launch Template Restrictions ."
    },
    {
      "Error code": "MissingInput",
      "Description": "An input parameter is missing."
    },
    {
      "Error code": "NatGatewayLimitExceeded",
      "Description": "You've reached the limit on the number of NAT gateways that you can create. For more information, see Amazon VPC Limits."
    },
    {
      "Error code": "NatGatewayMalformed",
      "Description": "The specified NAT gateway ID is not formed correctly. Ensure that you specify the NAT gateway ID in the form nat-xxxxxxxxxxxxxxxxx."
    },
    {
      "Error code": "NatGatewayNotFound",
      "Description": "The specified NAT gateway does not exist. Ensure that you have indicated the AWS Region in which the NAT gateway is located, if it's not in the default Region."
    },
    {
      "Error code": "NetworkAclEntryAlreadyExists",
      "Description": "The specified rule number already exists in this network ACL."
    },
    {
      "Error code": "NetworkAclEntryLimitExceeded",
      "Description": "You've reached the limit on the number of rules that you can add to the network ACL. For more information, see Amazon VPC Limits."
    },
    {
      "Error code": "NetworkAclLimitExceeded",
      "Description": "You've reached the limit on the number of network ACLs that you can create for the specified VPC. For more information, see Amazon VPC Limits. To request an increase on your network ACL limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "NetworkInterfaceLimitExceeded",
      "Description": "You've reached the limit on the number of network interfaces that you can create. For more information, see Amazon VPC Limits."
    },
    {
      "Error code": "NetworkInterfaceNotFoundException",
      "Description": "The specified network interface does not exist."
    },
    {
      "Error code": "NetworkInterfaceNotSupportedException",
      "Description": "The network interface is not supported for Traffic Mirror."
    },
    {
      "Error code": "NetworkLoadBalancerNotFoundException",
      "Description": "The specified Network Load Balancer does not exist."
    },
    {
      "Error code": "NlbInUseByTrafficMirrorTargetException",
      "Description": "The Network Load Balancer is already configured as a Traffic Mirror target."
    },
    {
      "Error code": "NonEBSInstance",
      "Description": "The specified instance does not support Amazon EBS. Restart the instance and try again, to ensure that the code is run on an instance with updated code."
    },
    {
      "Error code": "NoSuchVersion",
      "Description": "The specified API version does not exist."
    },
    {
      "Error code": "NotExportable",
      "Description": "The specified instance cannot be exported. You can only export certain instances. For more information, see Considerations When Using VM Export."
    },
    {
      "Error code": "OperationNotPermitted",
      "Description": "The specified operation is not allowed. This error can occur for a number of reasons; for example, you might be trying to terminate an instance that has termination protection enabled, or trying to detach the primary network interface (eth0) from an instance."
    },
    {
      "Error code": "OutstandingVpcPeeringConnectionLimitExceeded",
      "Description": "You've reached the limit on the number of VPC peering connection requests that you can create for the specified VPC."
    },
    {
      "Error code": "PendingSnapshotLimitExceeded",
      "Description": "You've reached the limit on the number of Amazon EBS snapshots that you can have in the pending state."
    },
    {
      "Error code": "PendingVpcPeeringConnectionLimitExceeded",
      "Description": "You've reached the limit on the number of pending VPC peering connections that you can have."
    },
    {
      "Error code": "PlacementGroupLimitExceeded",
      "Description": "You've reached the limit on the number of placement groups that you can have."
    },
    {
      "Error code": "PrivateIpAddressLimitExceeded",
      "Description": "You've reached the limit on the number of private IP addresses that you can assign to the specified network interface for that type of instance. For more information about the maximum number of private IP addresses per elastic network interface, see Private IP addresses per ENI."
    },
    {
      "Error code": "RequestResourceCountExceeded",
      "Description": "Details in your Spot request exceed the numbers allowed by the Spot service in one of the following ways, depending on the action that generated the error: If you get this error when you submitted a request for Spot Instances, check the number of Spot Instances specified in your request. The number shouldn't exceed the 3,000 maximum allowed per request. Resend your Spot Instance request and specify a number less than 3,000. If your account's regional Spot request limit is greater than 3,000 instances, you can access these instances by submitting multiple smaller requests. If you get this error when you sent Describe Spot Instance requests, check the number of requests for Spot Instance data, the amount of data you requested, and how often you sent the request. The frequency with which you requested the data combined with the amount of data exceeds the levels allowed by the Spot service. Try again and submit fewer large Describe requests over longer intervals."
    },
    {
      "Error code": "ReservedInstancesCountExceeded",
      "Description": "You've reached the limit for the number of Reserved Instances."
    },
    {
      "Error code": "ReservedInstancesLimitExceeded",
      "Description": "Your current quota does not allow you to purchase the required number of Reserved Instances."
    },
    {
      "Error code": "ReservedInstancesUnavailable",
      "Description": "The requested Reserved Instances are not available."
    },
    {
      "Error code": "Resource.AlreadyAssigned",
      "Description": "The specified private IP address is already assigned to a resource. Unassign the private IP first, or use a different private IP address."
    },
    {
      "Error code": "Resource.AlreadyAssociated",
      "Description": "The specified resource is already in use. For example, in EC2-VPC, you cannot associate an Elastic IP address with an instance if it's already associated with another instance. You also cannot attach an internet gateway to more than one VPC at a time."
    },
    {
      "Error code": "ResourceCountExceeded",
      "Description": "You have exceeded the number of resources allowed for this request; for example, if you try to launch more instances than AWS allows in a single request. This limit is separate from your individual resource limit. If you get this error, break up your request into smaller requests; for example, if you are launching 15 instances, try launching 5 instances in 3 separate requests."
    },
    {
      "Error code": "ResourceCountLimitExceeded",
      "Description": "You have exceeded a resource limit for creating routes."
    },
    {
      "Error code": "ResourceLimitExceeded",
      "Description": "You have exceeded an Amazon EC2 resource limit. For example, you might have too many snapshot copies in progress."
    },
    {
      "Error code": "RouteAlreadyExists",
      "Description": "A route for the specified CIDR block already exists in this route table."
    },
    {
      "Error code": "RouteLimitExceeded",
      "Description": "You've reached the limit on the number of routes that you can add to a route table."
    },
    {
      "Error code": "RouteTableLimitExceeded",
      "Description": "You've reached the limit on the number of route tables that you can create for the specified VPC. For more information about route table limits, see Amazon VPC Limits."
    },
    {
      "Error code": "RulesPerSecurityGroupLimitExceeded",
      "Description": "You've reached the limit on the number of rules that you can add to a security group. The limit depends on whether you are using EC2-Classic or EC2-VPC. For more information, see Security Group Rules."
    },
    {
      "Error code": "ScheduledInstanceLimitExceeded",
      "Description": "You've reached the limit on the number of Scheduled Instances that you can purchase."
    },
    {
      "Error code": "ScheduledInstanceParameterMismatch",
      "Description": "The launch specification does not match the details for the Scheduled Instance."
    },
    {
      "Error code": "ScheduledInstanceSlotNotOpen",
      "Description": "You can launch a Scheduled Instance only during its scheduled time periods."
    },
    {
      "Error code": "ScheduledInstanceSlotUnavailable",
      "Description": "The requested Scheduled Instance is no longer available during this scheduled time period."
    },
    {
      "Error code": "SecurityGroupLimitExceeded",
      "Description": "You've reached the limit on the number of security groups that you can create, or that you can assign to an instance. The limit depends on whether you are using EC2-Classic or EC2-VPC. For more information, see Creating Your Own Security Groups."
    },
    {
      "Error code": "SecurityGroupsPerInstanceLimitExceeded",
      "Description": "You've reached the limit on the number of security groups that you can assign to an instance. The limit depends on whether you are using EC2-Classic or EC2-VPC. For more information, see Amazon EC2 Security Groups."
    },
    {
      "Error code": "SecurityGroupsPerInterfaceLimitExceeded",
      "Description": "You've reached the limit on the number of security groups you can associate with the specified network interface. For more information, see Amazon VPC Limits."
    },
    {
      "Error code": "SignatureDoesNotMatch",
      "Description": "The request signature that Amazon has does not match the signature that you provided. Check your AWS access keys and signing method."
    },
    {
      "Error code": "SnapshotCopyUnsupported.InterRegion",
      "Description": "Inter-region snapshot copy is not supported for this AWS Region."
    },
    {
      "Error code": "SnapshotCreationPerVolumeRateExceeded",
      "Description": "The rate limit for creating concurrent snapshots of an EBS volume has been exceeded. Wait at least 15 seconds between concurrent volume snapshots."
    },
    {
      "Error code": "SnapshotLimitExceeded",
      "Description": "You've reached the limit on the number of Amazon EBS snapshots that you can create. To request an increase on your snapshot limit, complete the Amazon EC2 EBS Volume Limit Form."
    },
    {
      "Error code": "SubnetLimitExceeded",
      "Description": "You've reached the limit on the number of subnets that you can create for the specified VPC. For more information about subnet limits, see Amazon VPC Limits. To request an increase on your subnet limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "TagLimitExceeded",
      "Description": "You've reached the limit on the number of tags that you can assign to the specified resource. For more information, see Tag Restrictions."
    },
    {
      "Error code": "TrafficMirrorFilterInUse",
      "Description": "The Traffic Mirror filter cannot be deleted because a Traffic Mirror session is currently using it."
    },
    {
      "Error code": "TrafficMirrorSessionsPerInterfaceLimitExceeded",
      "Description": "The allowed number of Traffic Mirror sessions for the specified network interface has been exceeded."
    },
    {
      "Error code": "TrafficMirrorSessionsPerTargetLimitExceeded",
      "Description": "The maximum number of Traffic Mirror sessions for the specified Traffic Mirror target has been exceeded."
    },
    {
      "Error code": "TrafficMirrorSourcesPerTargetLimitExceeded",
      "Description": "The maximum number of Traffic Mirror sources for the specified Traffic Mirror target has been exceeded."
    },
    {
      "Error code": "TrafficMirrorTargetInUseException",
      "Description": "The Traffic Mirror target cannot be deleted because a Traffic Mirror session is currently using it."
    },
    {
      "Error code": "TrafficMirrorFilterLimitExceeded",
      "Description": "The maximum number of Traffic Mirror filters has been exceeded."
    },
    {
      "Error code": "TrafficMirrorFilterRuleLimitExceeded",
      "Description": "The maximum number of Traffic Mirror filter rules has been exceeded."
    },
    {
      "Error code": "TrafficMirrorSessionLimitExceeded",
      "Description": "The maximum number of Traffic Mirror sessions has been exceeded."
    },
    {
      "Error code": "TrafficMirrorTargetLimitExceeded",
      "Description": "The maximum number of Traffic Mirror targets has been exceeded."
    },
    {
      "Error code": "TrafficMirrorFilterRuleAlreadyExists",
      "Description": "The Traffic Mirror filter rule already exists."
    },
    {
      "Error code": "UnavailableHostRequirements",
      "Description": "There are no valid Dedicated Hosts available on which you can launch an instance."
    },
    {
      "Error code": "UnknownPrincipalType.Unsupported",
      "Description": "The principal type is not supported. The principal must be an IAM user, IAM role, or the root user for the AWS account."
    },
    {
      "Error code": "UnknownVolumeType",
      "Description": "The specified volume type is unsupported. The supported volume types are gp2, io1, st1, sc1, and standard."
    },
    {
      "Error code": "Unsupported",
      "Description": "The specified request is unsupported. For example, you might be trying to launch an instance in an Availability Zone that currently has constraints on that instance type. The returned message provides details of the unsupported request."
    },
    {
      "Error code": "UnsupportedException",
      "Description": "Capacity Reservations are not supported for this Region."
    },
    {
      "Error code": "UnsupportedHibernationConfiguration",
      "Description": "The instance could not be launched because one or more parameter values do not meet the prerequisites for enabling hibernation. For more information, see Hibernation Prerequisites. Alternatively, the instance could not be hibernated because it is not enabled for hibernation."
    },
    {
      "Error code": "UnsupportedHostConfiguration",
      "Description": "The specified Dedicated Host configuration is unsupported. For more information about supported configurations, see Dedicated Hosts."
    },
    {
      "Error code": "UnsupportedInstanceTypeOnHost",
      "Description": "The instance type is not supported on the Dedicated Host. For more information about supported instance types, see Amazon EC2 Dedicated Hosts Pricing."
    },
    {
      "Error code": "UnsupportedTenancy",
      "Description": "The specified tenancy is unsupported. You can change the tenancy of a VPC to default only."
    },
    {
      "Error code": "UpdateLimitExceeded",
      "Description": "The default credit specification for an instance family can be modified only once in a rolling 5-minute period, and up to four times in a rolling 24-hour period. For more information, see Setting the Default Credit Specification for the Account."
    },
    {
      "Error code": "VolumeInUse",
      "Description": "The specified Amazon EBS volume is attached to an instance. Ensure that the specified volume is in an available state."
    },
    {
      "Error code": "VolumeIOPSLimit",
      "Description": "The maximum IOPS limit for the volume has been reached. For more information, see Amazon EBS Volume Types."
    },
    {
      "Error code": "VolumeLimitExceeded",
      "Description": "You've reached the limit on your Amazon EBS volume storage. To request an increase, complete the Amazon EC2 EBS Volume Limit Form."
    },
    {
      "Error code": "VolumeModificationSizeLimitExceeded",
      "Description": "You've reached the limit on your Amazon EBS volume modification storage in this Region. To request an increase, complete the Amazon EC2 EBS Volume Limit Form, or wait for the current volume modifications to complete and then retry your request."
    },
    {
      "Error code": "VolumeTypeNotAvailableInZone",
      "Description": "The specified Availability Zone does not support Provisioned IOPS SSD volumes. Try launching your instance in a different Availability Zone, or don't specify a zone in the request. If you're creating a volume, try specifying a different Availability Zone in the request."
    },
    {
      "Error code": "VpcCidrConflict",
      "Description": "You cannot enable a VPC for ClassicLink if the VPC has routing that conflicts with the EC2-Classic private IP address range of 10/8; for example, if your VPC's route table points to 10.0.0.0/16 for a VPC peering connection. This excludes local routes for VPCs in the 10.0.0.0/16 and 10.1.0.0/16 IP address ranges. For more information, see Routing for Classic Link."
    },
    {
      "Error code": "VPCIdNotSpecified",
      "Description": "You have no default VPC in which to carry out the request. Specify a VPC or subnet ID or, in the case of security groups, specify the ID and not the security group name. To create a new default VPC, contact AWS Support."
    },
    {
      "Error code": "VpcEndpointLimitExceeded",
      "Description": "You've reached the limit on the number of VPC endpoints that you can create in the AWS Region. For more information about VPC limits, see Amazon VPC Limits. To request an increase on your VPC limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "VpcLimitExceeded",
      "Description": "You've reached the limit on the number of VPCs that you can create in the AWS Region. For more information about VPC limits, see Amazon VPC Limits. To request an increase on your VPC limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "VpcPeeringConnectionAlreadyExists",
      "Description": "A VPC peering connection between the VPCs already exists."
    },
    {
      "Error code": "VpcPeeringConnectionsPerVpcLimitExceeded",
      "Description": "You've reached the limit on the number of VPC peering connections that you can have per VPC. For more information, see Amazon VPC Limits."
    },
    {
      "Error code": "VPCResourceNotSpecified",
      "Description": "The specified resource can be used only in a VPC; for example, T2 instances. Ensure that you have a VPC in your account, and then specify a subnet ID or network interface ID in the request."
    },
    {
      "Error code": "VpnConnectionLimitExceeded",
      "Description": "You've reached the limit on the number of VPN connections that you can create. For more information about limits, see Amazon VPC Limits. To request an increase on your VPN connection limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "VpnGatewayAttachmentLimitExceeded",
      "Description": "You've reached the limit on the number of VPCs that can be attached to the specified virtual private gateway."
    },
    {
      "Error code": "VpnGatewayLimitExceeded",
      "Description": "You've reached the limit on the number of virtual private gateways that you can create. For more information about limits, see Amazon VPC Limits. To request an increase on your virtual private gateway limit, complete the Amazon VPC Limits form."
    },
    {
      "Error code": "ZonesMismatched",
      "Description": "The Availability Zone for the instance does not match that of the Dedicated Host."
    }
  ],
  [
    {
      "Error code": "InsufficientAddressCapacity",
      "Description": "Not enough available addresses to satisfy your minimum request. Reduce the number of addresses you are requesting or wait for additional capacity to become available."
    },
    {
      "Error code": "InsufficientCapacity",
      "Description": "There is not enough capacity to fulfill your import instance request. You can wait for additional capacity to become available."
    },
    {
      "Error code": "InsufficientInstanceCapacity",
      "Description": "There is not enough capacity to fulfill your request. This error can occur if you launch a new instance, restart a stopped instance, create a new Capacity Reservation, or modify an existing Capacity Reservation. Reduce the number of instances in your request, or wait for additional capacity to become available. You can also try launching an instance by selecting different instance types (which you can resize at a later stage). The returned message might also give specific guidance about how to solve the problem."
    },
    {
      "Error code": "InsufficientHostCapacity",
      "Description": "There is not enough capacity to fulfill your Dedicated Host request. Reduce the number of Dedicated Hosts in your request, or wait for additional capacity to become available."
    },
    {
      "Error code": "InsufficientReservedInstanceCapacity",
      "Description": "Not enough available Reserved Instances to satisfy your minimum request. Reduce the number of Reserved Instances in your request or wait for additional capacity to become available."
    },
    {
      "Error code": "InternalError",
      "Description": "An internal error has occurred. Retry your request, but if the problem persists, contact us with details by posting a message on the AWS forums."
    },
    {
      "Error code": "InternalFailure",
      "Description": "The request processing has failed because of an unknown error, exception, or failure."
    },
    {
      "Error code": "RequestLimitExceeded",
      "Description": "The maximum request rate permitted by the Amazon EC2 APIs has been exceeded for your account. For best results, use an increasing or variable sleep interval between requests. For more information, see Query API request rate."
    },
    {
      "Error code": "ServiceUnavailable",
      "Description": "The request has failed due to a temporary failure of the server."
    },
    {
      "Error code": "Unavailable",
      "Description": "The server is overloaded and can't handle the request."
    }
  ]
]
