[
  {
    "Name": "Action",
    "Description": "The action to perform. Example: RunInstances",
    "Required": "Yes"
  },
  {
    "Name": "Version",
    "Description": "The API version to use.",
    "Required": "Yes"
  },
  {
    "Name": "X-Amz-Algorithm",
    "Description": "The hash algorithm you use to create the request signature. Example: AWS4-HMAC-SHA256",
    "Required": "Yes"
  },
  {
    "Name": "X-Amz-Credential",
    "Description": "The credential scope for the request, in the format access-key-ID/YYYYMMDD/region/service/aws4_request Example: AKIDEXAMPLE/20140707/us-east-1/ec2/aws4_request",
    "Required": "Yes"
  },
  {
    "Name": "X-Amz-Date",
    "Description": "The date and time at which the request is signed, in the format YYYYMMDDThhmmssZ. The date must match the date that's included in the credential scope for the X-Amz-Credential parameter, or the date used in an Authorization header (see the note below the table). Example: 20140707T150456Z",
    "Required": "Yes"
  },
  {
    "Name": "X-Amz-SignedHeaders",
    "Description": "The headers you are including as part of the request. At a minimum, you must include the host header. If you include an x-amz-date header in your request, you must include it in the list of signed headers. Example: content-type;host;user-agent",
    "Required": "Yes"
  },
  {
    "Name": "X-Amz-Signature",
    "Description": "A signature derived from your secret access key. Example: ced6826de92d2bdeed8f846f0bf508e8559example",
    "Required": "Yes"
  },
  {
    "Name": "X-Amz-Security-Token",
    "Description": "The temporary security token obtained through a call to AWS Security Token Service. Example: AQoEXAMPLEH4aoAH0gNCAPyJxz4BlCFFxWNE1OPTgk5TthT+FvwqnKwRcOIfrRh3c/L",
    "Required": "No"
  },
  {
    "Name": "DryRun",
    "Description": "Checks whether you have the required permissions for the action, without actually making the request. If you have the required permissions, the request returns DryRunOperation; otherwise, it returns UnauthorizedOperation.",
    "Required": "No"
  }
]
