[
  {
    "title": "Filter",
    "attrs": {
      "Key": {
        "type": "String",
        "required": "No",
        "desc": "Filters your list of secrets by a specific key."
      },
      "Values": {
        "type": "Array of strings",
        "length": "Minimum length of 1. Maximum length of 512.",
        "pattern": "[a-zA-Z0-9 :_@\\/\\+\\=\\.\\-]+",
        "required": "No",
        "desc": "Filters your list of secrets by a specific value."
      }
    }
  },
  {
    "title": "RotationRulesType",
    "attrs": {
      "AutomaticallyAfterDays": {
        "type": "Long",
        "required": "No",
        "desc": "Specifies the number of days between automatic scheduled rotations of the secret. Secrets Manager schedules the next rotation when the previous one is complete. Secrets Manager schedules the date by adding the rotation interval (number of days) to the actual date of the last rotation. The service chooses the hour within that 24-hour date window randomly. The minute is also chosen somewhat randomly, but weighted towards the top of the hour and influenced by a variety of factors that help distribute load."
      }
    }
  },
  {
    "title": "SecretListEntry",
    "attrs": {
      "ARN": {
        "type": "String",
        "length": "Minimum length of 20. Maximum length of 2048.",
        "required": "No",
        "desc": "The Amazon Resource Name (ARN) of the secret. For more information about ARNs in Secrets Manager, see Policy Resources in the AWS Secrets Manager User Guide."
      },
      "CreatedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The date and time when a secret was created."
      },
      "DeletedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The date and time the deletion of the secret occurred. Not present on active secrets. The secret can be recovered until the number of days in the recovery window has passed, as specified in the RecoveryWindowInDays parameter of the DeleteSecret operation."
      },
      "Description": {
        "type": "String",
        "length": "Maximum length of 2048.",
        "required": "No",
        "desc": "The user-provided description of the secret."
      },
      "KmsKeyId": {
        "type": "String",
        "length": "Minimum length of 0. Maximum length of 2048.",
        "required": "No",
        "desc": "The ARN or alias of the AWS KMS customer master key (CMK) used to encrypt the SecretString and SecretBinary fields in each version of the secret. If you don't provide a key, then Secrets Manager defaults to encrypting the secret fields with the default KMS CMK, the key named awssecretsmanager, for this account."
      },
      "LastAccessedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The last date that this secret was accessed. This value is truncated to midnight of the date and therefore shows only the date, not the time."
      },
      "LastChangedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The last date and time that this secret was modified in any way."
      },
      "LastRotatedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The most recent date and time that the Secrets Manager rotation process was successfully completed. This value is null if the secret hasn't ever rotated."
      },
      "Name": {
        "type": "String",
        "length": "Minimum length of 1. Maximum length of 256.",
        "required": "No",
        "desc": "The friendly name of the secret. You can use forward slashes in the name to represent a path hierarchy. For example, /prod/databases/dbserver1 could represent the secret for a server named dbserver1 in the folder databases in the folder prod."
      },
      "OwningService": {
        "type": "String",
        "length": "Minimum length of 1. Maximum length of 128.",
        "required": "No",
        "desc": "Returns the name of the service that created the secret."
      },
      "RotationEnabled": {
        "type": "Boolean",
        "required": "No",
        "desc": "Indicates whether automatic, scheduled rotation is enabled for this secret."
      },
      "RotationLambdaARN": {
        "type": "String",
        "length": "Minimum length of 0. Maximum length of 2048.",
        "required": "No",
        "desc": "The ARN of an AWS Lambda function invoked by Secrets Manager to rotate and expire the secret either automatically per the schedule or manually by a call to RotateSecret."
      },
      "RotationRules": {
        "type": "RotationRulesType object",
        "required": "No",
        "desc": "A structure that defines the rotation configuration for the secret."
      },
      "SecretVersionsToStages": {
        "type": "String to array of strings map",
        "length": "Minimum length of 1. Maximum length of 256.",
        "required": "No",
        "desc": "A list of all of the currently assigned SecretVersionStage staging labels and the SecretVersionId attached to each one. Staging labels are used to keep track of the different versions during the rotation process."
      },
      "Tags": {
        "type": "Array of Tag objects",
        "required": "No",
        "desc": "The list of user-defined tags associated with the secret. To add tags to a secret, use TagResource. To remove tags, use UntagResource."
      }
    }
  },
  {
    "title": "SecretVersionsListEntry",
    "attrs": {
      "CreatedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The date and time this version of the secret was created."
      },
      "LastAccessedDate": {
        "type": "Timestamp",
        "required": "No",
        "desc": "The date that this version of the secret was last accessed. Note that the resolution of this field is at the date level and does not include the time."
      },
      "VersionId": {
        "type": "String",
        "length": "Minimum length of 32. Maximum length of 64.",
        "required": "No",
        "desc": "The unique version identifier of this version of the secret."
      },
      "VersionStages": {
        "type": "Array of strings",
        "length": "Minimum length of 1. Maximum length of 256.",
        "required": "No",
        "desc": "An array of staging labels that are currently associated with this version of the secret."
      }
    }
  },
  {
    "title": "Tag",
    "attrs": {
      "Key": {
        "type": "String",
        "length": "Minimum length of 1. Maximum length of 128.",
        "required": "No",
        "desc": "The key identifier, or name, of the tag."
      },
      "Value": {
        "type": "String",
        "length": "Minimum length of 0. Maximum length of 256.",
        "required": "No",
        "desc": "The string value associated with the key of the tag."
      }
    }
  },
  {
    "title": "ValidationErrorsEntry",
    "attrs": {
      "CheckName": {
        "type": "String",
        "length": "Minimum length of 1. Maximum length of 512.",
        "required": "No",
        "desc": "Checks the name of the policy."
      },
      "ErrorMessage": {
        "type": "String",
        "required": "No",
        "desc": "Displays error messages if validation encounters problems during validation of the resource policy."
      }
    }
  }
]